//
//  Plan.swift
//  Syrym's FlowerShop
//
//  Created by Syrym Khamzin on 19.05.2023.
//

import Foundation

// MARK: -- Задачи
// Получить все экраны от дизайнера
// Получить все ссылки на загрузку
// Создать картеж со всеми цветами приложения
// Какие библиотеки использовать
// Определиться с моделью
// Получить все иконки и главную иконку приложения
// Базовые функции (Диалог если нет интернета, позвонить, открыть ссылку в браузере и так далее, смс, почта)
// Перенос дизайна в проект
// Алгоритм
// Добавить Splash Screen

// MARK: -- Выполненные действия
// Получить все экраны от дизайнера
// Получить все ссылки на загрузку
// Создать картеж со всеми цветами приложения
// Какие библиотеки использовать (kingfisher, lottie)
// Определиться с моделью
// Получить все иконки и главную иконку приложения
// Базовые функции (Диалог если нет интернета, позвонить, открыть ссылку в браузере и так далее, смс, почта)
// Перенос дизайна в проект
// Алгоритм
// Добавить Splash Screen

// Создание класса для всех функций
// Создали
// Позвонить
// Отправить письмо
// Создали диалог для вывода информации

// библиотеки
// KingFisher
// Lottie

// MARK: -- Questions/Answers

// HW
// // Создать экран VC с wkWebKit +
// дописать метод callNumber +
// скачать photoshop +

// HW
// Figma

// HW
// дописать searchBar поиск

// HW
// Заполнить все секции и строки в массив - включая картинки +
// Все компоненты cell, связать с классом +

// Question
// Вопросы по webBrowser.
// toolBar поднимается и в Category Screen после перехода из webBrowser.
// Не видно toolBar в webBrowser
// Answer
// TabBar и ToolBar накладываются друг на друга,
// поэтому ToolBar невиден

// HW
// MenuTableVC

// Questions
// Можно ли сделать то же самое, только созданием одного контроллера? +
// Клавиатура не закрывается на телефоне после нажатия на searchBar +

// HW
// Переделать Menu, привязать все контроллеры к классам

// Questions
// Правильно ли я сделал, что при нажатии на ячейку "поделиться" можно сразу поделиться ссылкой на проект, не открывая дополнительный экран?
// Можно на уроке написать вариант с tableView?

// Questions
// То как я написал код для "режима работы" и "поделиться", не сделает ли это код грязным? +
// На главном экране, последняя ячейка (Букеты из Орхидей) не имеет navigationBar. Я не понял как это исправить +

// HW
// Загрузить данные по ссылке
// Создать класс +
// Добавить refreshControl 

// HW
// Так же, как и gifts
// Обязательно проверять интернет соединение

// Question
// Что-то баннер не отображается

// HW
// Убрать браузер с tabBar
// Переместить кнопку меню в tabBar

// Question
// Как изменить  высоту tabBar?

// HW
// Дописать экран DetailScreen

// HW
// Создать кнопку "Share" для текста и картинки

// Question
// Можем проверить кнопку "поделиться". Правильно ли я написал код для картинки?
// (Картинка не открывается)
// Когда листаю вниз на экране categories, дергается экран на телефоне.

// Question
// Что-то переходит между tf странно

// HW
// Создать TVC для выбора кода страны 

// Question
// Код/страна записал в dictionary
// Не получается извлечь данные
// Answer
// Надо записывать через struct

// Question
// Стоит ли еще поработать над deliveryLabel в OrderTVC?
// Я перенес его в центр, и добавил таймер для тестa
// или, лучше будет, если вообще не перезаписывать?
// Думаю сделать зеленую рамочку для cell, textField, и searchBar
// чтобы пользователь знал, что на все зеленое можно нажать
// Почему не показывается анимация, которую я загрузил позже?

// HW
// дописать программно стэк, 2 лейбла, и кнопку
// StackView
// LabelForTitle
// labelForDescription
// 2 labels объеденить в stack
// Button
// Done


// MARK: -- Final HomeWork for FlowerApp

// MARK: -- Final Changes
// searchBar in country code to close on swipe +
// textfields to close once editing finished +
// keyboard to be closed after sending order +
// alert "ok" button color change +

// screenshot +
// Done

// описание +
// Flower shop app for fast delivery of fresh flowers in the city of Almaty

// ключевые слова (через запятую до 100 символов) +
// flowers, fresh, free delivery, fast delivery, almaty, occasion, celebration, birthday, valentine's day, flowers rental,special offer

// перевести все на англ +
// Done

// promotional text +
// Free and fast delivery of super fresh flowers in Almaty

// subtitle +
// Flowers delivery in Almaty
